CSI API ETABS v1
cDCompColEurocode_4_2004 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDCompColEurocode_4_2004
Public Interface cDCompColEurocode_4_2004
Dim instance As cDCompColEurocode_4_2004
public interface class cDCompColEurocode_4_2004
type cDCompColEurocode_4_2004 =  interface end
The cDCompColEurocode_4_2004 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a composite column design overwrite item
GetPreference
 Retrieves the value of a composite column design preference item.
SetOverwrite
 Sets the value of a composite column design overwrite item
SetPreference
 Sets the value of a composite column design preference item.
Top
See Also
Reference
ETABSv1 Namespace